#include <stdio.h>
#include <stdlib.h>
#include <iostream>
#define STR1 "Today we are"
#define STR2 "learning how to "
#define STR3 "\"Programm on C++\""
#define STR4 "Banderu Lviv"

int main()
{
    printf("|%s|\n", STR1);        // Виводить повний рядок STR1
    printf("|%70.12s|\n", STR2);   // Виводить лише перші 12 символів STR2, з вирівнюванням по правому краю на 70 позицій
    printf("|%70.24s|\n\n", STR3); // Виводить 24 символи STR3 з вирівнюванням по правому краю на 70 позицій

    printf("|%20.5s|\n", STR1);  // Виводить перші 5 символів STR1, вирівнюючи по правому краю на 20 позицій
    printf("|%20.8s|\n", STR2);  // Виводить перші 8 символів STR2, вирівнюючи по правому краю на 20 позицій
    printf("|%-20.9s|\n", STR3); // Виводить перші 9 символів STR3, вирівнюючи по лівому краю на 20 позицій

    // Виводимо STR4 повністю
    printf("|%s|\n", STR4);

    // Виводимо перше слово "Banderu" на початку нового рядка
    printf("|%-20.7s|\n", STR4);

    // Виводимо перше слово "Banderu" на кінці нового рядка
    printf("|%20.7s|\n", STR4);

    system("pause");
    return 0;
}

// Завдання до програми 1_6. Додайте ще рядок STR4 з двома
// заданими словами за допомогою директиви #define. Доповніть
// програму, щоб на екран виводились ці слова повністю (з межами на
// початку та кінці рядка екрана), потім на новому рядку тільки перше
// слово спочатку рядка екрана (також з межами на початку та кінці
// екрана) і на наступному рядку перше слово на кінці рядка екрана.
